tutorials/incompressible/icoFoam/mixingPlane/twoBlocksMixingPlane_stackAxisY_sweepAxisZ/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)

    (1 0 0)
    (2 0 0)
    (2 1 0)
    (1 1 0)
    (1 0 0.1)
    (2 0 0.1)
    (2 1 0.1)
    (1 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 10 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (10 10 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall top
    (
        (3 7 6 2)
        (11 15 14 10)
    )
    wall bottom
    (
        (1 5 4 0)
        (9 13 12 8)
    )
    patch leftIn
    (
        (0 4 7 3)
    )
    mixingPlane mixpLeftOut
    (
        (2 6 5 1)
    )
    mixingPlane mixpRightIn
    (
        (8 12 15 11)
    )
    patch rightOut
    (
        (10 14 13 9)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
        (8 11 10 9)
        (12 13 14 15)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
